{"images":[{"image":202530,"name":"M Shed ICT, People, digital image, Skimmity Hitchers","description":"Bristol-based Scrumpy and Western band Skimmity Hitchers. From left to right: Rat Black, Tatty Smart, Magners O'Magnersson, Drum Cheddar.","copyright":null}],"video":[{"image":202530,"name":"M Shed, ICT, Video, Skimmity Hitchers, People Arr Strange","description":"Skimmity Hitchers perform People Arr Strange at The Seven Stars pub, Thomas Lane, Bristol, June 4, 2016.","copyright":null,"video":202529}],"name":"Skimmity Hitchers - Scrumpy and Western","id":14318,"description":"When you think of Bristol bands, the obvious names spring to mind \u0096 the deserving legends of trip-hop, post-punk, drum and bass, etc. But the city's music scene is a huge and many tentacled beast, spawning hundreds of bands across the decades. Some you will have heard of, most you won't, but they have all added their talent and sweat to the collective lifeblood. They all deserve their part in the story.\n\nSkimmity Hitchers are one such band. Formed from the ashes of Dorset sectarians Who's Afear'd, (whose own first songs were fleshed and hammered out in a BS2 back yard) the 'Hitchers have been bringing their blend of messed-up West Country parodies and original material to unsuspecting crowds all over the city since 2010.\n\nLike many Bristol bands Skimmity Hitchers don't boast a native Bristolian among them. Drawn to the city for a whole range of different reasons (work, love, Sunday football) they found themselves brought together through chance. Like many bands there was no big plan, just a desire to get together and make some sense of life with instruments and alcohol. Cutting their teeth in great boozers such as The Plough and Seven Stars, plus Gloucester Road institutions the Cat & Wheel and Blue Lagoon, they've paid their dues like so many hard-working Bristol acts and learned a lot along the way.\n\nDescribed by frontman Tatty Smart as \u0093a joke that went too far\u0094 the band have gone from cheeky chancers to in-demand festival raconteurs. Headline slots at The Exchange in Old Market and three sold out Fleece gigs with The Wurzels are proof that Bristol still looks after its own. \u0093We're proud to say that we live and work in Bristol\u0094, says double bass player Magners O'Magnersson, \u0093it's an incredibly creative and friendly place and lacks the pretentiousness and entitlement of Certain Other Cities.\u0094\n\nAlthough the band play many gigs in the rural wilds of Somerset, Dorset and Devon, the influence of Bristol runs deep. Celebrating the diversity and dynamism of the city while respecting its history and traditions, they have loved immersing themselves in their adopted home.  Proudly linked with leftfield Bristol institutions such as the Easton Cowboys and Cowgirls, Bristol Radical History Group and the local trade union movement (they serenaded Tony Benn with his own personal number at the opening of the new Unite HQ on Victoria Street) there's more to them than a cider-and-dung stage act.\n\nFor the band, Bristol is very much the border of city and country life. To that effect Skimmity Hitchers songs celebrate and mock parochialism in equal measures, holding up a mirror to hipsters and bumpkins alike. Man-at-the-back Drum Cheddar says: \u0093We like to challenge people's conceptions and boundaries, including our own, and encourage people not to take themselves too seriously. There's a real buzz in turning the normal order upside down and bringing different types of people together. There's a serious message in what we do \u0096 you'll just have a lot of fun in working out what it is.\u0094\n\nSo what are their influences? Smart states: \u0093We're proud to call ourselves a Scrumpy & Western band, in the tradition of The Wurzels. Playing with those guys has been a real highlight for us. We love the old style, earthy wit of Adge Cutler and Fred Wedlock, but also we wouldn't exist if we hadn't seen the Surfin' Turnips play at The Junction in 2005. We love punk, reggae, jazz, Johnny Cash, KATG - it's all cider music isn't it?\u0094\n\nCatch the Skimmity Hitchers in a pub, festival or cider shed near to you soon.","summary":"Press the play button to watch Skimmity Hitchers performing at the historic Seven Stars pub on Thomas Lane, Bristol.","source":null,"keywords":["PPL-CR-ICT05"],"type":[],"location":"Bristol People","objects":[{"image":48777,"copyright":"© Bristol Museums, Galleries and Archives","description":"Pink 'Technics' quarter deck and turntable, with black slip mat.","credit_line":null,"id":160584,"name":"record player"}],"child":[{"image":202533,"name":"Skimmity Hitchers in concert","link":"skimmity-hitchers-in-concert","id":14319},{"image":202531,"name":"Skimmity Hitchers in a field in Dorset","link":"skimmity-hitchers-in-a-field-in-dorset","id":14320}],"parent":[]}