{"images":[{"image":45320,"name":"M Shed graphic, Patey headline,","description":"Headline from Evening Post newspaper report 30 April 1963 re Bristol bus boycott","copyright":"© Bristol Evening Post"},{"image":34633,"name":"Living Bristol, Roy Hackett ( 43743\/4\/4)","description":"Roy Hackett at home, 2007. \nRoy Hackett was a key player in the Bristol Bus Boycott Campaign and is a founder member of Bristol West Indian Parents & Friends. Previously foreman of 52 employees at St Anne's Board Mill he has also taken on many community roles: BREC (Bristol Racial Equality Council) committee member, St Paul's Festival committee member, chair of the Bamboo Club management committee, and warden at Pioneer Council, a hostel for young homeless men in Bedminster.  Roy received the Jamaican High Commissioner award for outstanding contribution to his community and Maundy Money from the Queen in 1993 in recognition of his good work.","copyright":"© Paul Bullivant","video":45517,"file":"mp4","filetype":"mp4"}],"video":[{"image":45320,"name":"M Shed film, Bus Boycott comp","description":"BBC News report on the Bristol bus boycott 25th anniversary in 1988","copyright":null,"video":45517,"file":"mp4","filetype":"mp4"}],"name":"Boycott the buses","id":2995,"description":"Paul Stephenson, a youth worker in Bristol, became involved in the campaign to reduce discrimination against black people in employment when Guy Bailey's application to be a bus driver was turned down. A visit to Ian Patey, Bristol Omnibus Company's general manager, confirmed that the company maintained a bar on employing black people, perfectly legally and with the support of the trade unions.\n\nStephenson was inspired to action by the American black civil rights activists, who were also taking action on buses. \"You couldn't help but be impressed by Martin Luther King and what he was doing in America.  But without Rosa Parks I'm not sure whether we would have embarked on our boycott.  She was a huge influence on me.  I thought if she could protest by not giving up her seat on a bus we could start a boycott.\"\n\nStephenson's idea attracted the attention of the national and international media, and the support of many leading politicians. Tony Benn, MP for Bristol South East declared \"I shall stay off the buses, even if I have to find a bike\" and Labour leader Harold Wilson stated \"I'm glad that so many Bristolians are supporting the campaign to get it [the colour-bar] abolished.  We wish them every success\".\n\nEventually the colour bar was dropped after four months of negotiations between the company and the union. Stephenson was sidelined during this process and faced much hostility as he was accused of stirring up trouble unnecessarily.","summary":"(Rosa Parks) was a huge influence on me.  I thought if she could protest by not giving up her seat on a bus we could start a boycott.","source":"Paul Stephenson","keywords":["PPL-CH-ICT03"],"type":["Story"],"location":"","objects":[[]],"child":[],"parent":[{"image":37264,"name":"Boycotting","link":"boycotting","id":3293},{"image":53226,"name":"Celebrating Bristol's black history","link":"celebrating-bristol-s-black-history","id":14389}]}