{"images":[{"image":36199,"name":"BRO SMV\/8\/3\/4\/2\/27 [i]","description":"Letter from women's anti-slavery Society asking clergy to boycott sugar 1830","copyright":"© Bristol Museums, Galleries and Archives"}],"name":"Mary Anne Galton gives up sugar","id":2996,"description":"When she was about 12, Mary Anne Galton decided to give up sugar as a personal protest against the slave trade. She wrote:\n\n'I became much interested, during my Dudson [near Birmingham]  visits, in the anti-slavery cause.  In the evenings we often read pamphlets on the subject, or examined in detail the prints of slave ships and slave treatment.  Mr Clarkson was a constant visitor at Dudson, and also at my cousin Lloyd's: and both my cousins and I resolved to leave off sugar, as the only produce of slave labour within our province to discontinue ... I abstained more zealously than ever, though alone in my family, from using sugar, as the produce of slave labour... I embraced with joy this sacrifice, which bore a comforting testimony to myself that I had some real principle ... and because I held it, I was subject to daily ridicule and taunts'\n\nAfter she married and moved to Bristol, as Mrs Schimmelpenninck, she joined the Bristol and Clifton Female Anti-Slavery Society in 1829, who called for women to buy Free or Bengal sugar and to bring up their children to abhor the system of slavery.  She paid her guinea membership fee (£1.05, more than the weekly wage of a teacher at the time, and equivalent today to about £70.00) and campaigned tirelessly. \n\nAccording to Thomas Clarkson, the anti-slavery campaigner, 'no fewer than three hundred thousand persons had abandoned the use of sugar' by the time of the abolition of slavery in 1833.","summary":"my cousins and I resolved to leave off sugar, as the only produce of slave labour within our province to discontinue","source":"Mary Anne Schimmelpenninck (nee Galton)","keywords":["PPL-CH-ICT03"],"type":["Story"],"location":"","objects":[[]],"child":[],"parent":[{"image":37264,"name":"Boycotting","link":"boycotting","id":3293}]}