{"images":[{"image":36147,"name":"People graphic, digital image, The Wild Bunch, copy of original photo by Beezer","description":"The Wild Bunch performing at the Dug-Out Club, 1984. Left to right: Milo, Daddy G, Nellee Hooper, Willie Wee, 3D","copyright":"© Beezer Photos"}],"name":"The story of The Wild Bunch and Massive Attack","id":7067,"description":"Massive Attack was formed in 1988 from the remaining members of hip hop crew The Wild Bunch. The band comprised Robert Del Naja (Delge), Grant Marshall (Daddy G) and Andrew Vowles (Mushroom).\n\nMushroom explains how the Massive Attack story started during his school days: \"I was only 15, but Daddy G got me a membership card for The Dug Out club so I could go to all the hip hop jams.\"\n\nHis love affair with hip hop led him to follow Bristol crew The Wild Bunch to gigs all over the country. He got friendly with bandmates Daddy G and Delge and impressed them with his mixing skills between sets. During this time, the pink Technics turntable - currently on loan to M Shed - was allegedly a favourite of Daddy G's.  \n\nThe Wild Bunch split when Nellee Hooper left to work with Soul II Soul and Miles Johnson moved to America. Daddy G, Delge and Mushroom went on to form Massive Attack in 1988.\n\nBlue Lines was Massive Attack's first album, released in 1991. It gave the band one of its most enduring hits Unfinished Sympathy and involved collaboration with then-unknown hip hop artist Tricky and singer Shara Nelson. \n\nDelge recalls: \"The way Blue Lines was put together was so hit and miss ... Mushroom was on the turntables cutting up some crazy beat and Shara was singing this song Kiss and Tell which became Unfinished Sympathy. It wasn't really happening, but we added some keyboards and, when we started arranging the song, we knew we really had something.\"\n\nThe album received almost universal praise and became a firm favourite with hip hop and dance fans. Local DJ John Stapleton can remember the impact that it had on the club scene: \n\n\"Blue Lines takes me back to my days dj-ing at hip hop nights like Def Con at the Thekla. I even played the first press of Massive Attack's first single Any Love during one of my sets. I'd followed the band members since their days in the Wild Bunch and Blue Lines was a great album. It still sounds fresh, although it's 20 years on.\"\n\nBlue Lines' follow-up Protection was released in 1994. The band was now minus Shara Nelson, but their collaboration with Everything But The Girl's Tracey Thorn on title track Protection gave them another hit. \n\nMezzanine was the last album to be completed by Massive Attack's original line-up. Mushroom left the band in 1999 and Daddy G was on sabbatical during the recording of 2003's 100th Window. The album was generally well received, but was not without its critics. Allmusic's John Bush:\n\n\"Though Del Naja is mostly successful in giving the people what they want - a follow-up to Mezzanine, one of the most compulsive listens of '90s electronica - it unfortunately comes as a sacrifice to the very thing that made Massive Attack so crucial to dance music: their never-ending progression to a radically different sound with each release.\"\n\nSince then, releases have included Collected, Massive Attack's contractually obliged compilation album of 2006; Splitting the Atom, a 2009 EP featuring guest vocals by Horace Andy and keyboards by Damon Albarn; and their fifth studio album to date, Heligoland, released in 2010 to widespread critical acclaim.\n\nReferences:\n\nJohnson, Phil (1997) Massive Attack, Portishead, Tricky and the Roots of Trip Hop: Straight Outa Bristol, London: Hodder and Stoughton\n\nwww.allmusic.com","summary":"Pictured to the right are members of The Wild Bunch - Milo, Daddy G, Nellee Hooper, Willie Wee, 3D - at the Dug-Out Club in 1984. Nellee Hooper, on the decks, became an award-winning record producer and composer, famously producing the debut albums for Soul II Soul, Massive Attack and Björk.","source":null,"keywords":["PPL-CR-ICT05"],"type":["Story"],"location":"Bristol People","objects":[{"image":48777,"copyright":"© Bristol Museums, Galleries and Archives","description":"Pink 'Technics' quarter deck and turntable, with black slip mat.","credit_line":null,"id":160584,"name":"record player"}],"child":[{"image":48777,"name":"The Technics record deck and The Wild Bunch","link":"the-technics-record-deck-and-the-wild-bunch","id":7065}],"parent":[{"image":48777,"name":"Bristol's music scene","link":"bristol-s-music-scene","id":3641}]}