{"images":[{"image":94782,"name":"BCRL, M Shed ICT, People, record sleeve, Adge Cutler & The Wurzels","description":"Scanned image of record sleeve: Adge Cutler & The Wurzels: Carry On Cutler! (1969). EMI Columbia label. Price marked [£] 2.50.","copyright":"© Bristol Central Reference Library"}],"video":[{"image":94782,"name":"M Shed, ICT, Video, The Wurzels, Drink Up Thy Zider","description":"Adge Cutler and The Wurzels perform their song 'Drink Up Thy Zider' at Coates cider factory in Nailsea, Somerset, 1967.","copyright":"British Pathe or logo (see multimedia)","video":93267}],"name":"Adge Cutler and The Wurzels \u0096 Scrumpy and Western","id":7765,"description":"Originally known as Adge Cutler and The Wurzels, they sprung to the attention of the music world in 1966. They had a number one local hit in the Bristol and Somerset charts with Drink Up Thy Zider and in early 1967 the song reached the national charts at number 45. \n\nThe music that Adge Cutler and The Wurzels performed defies a straightforward definition. Adge was once quoted as saying:\n\n \"I suppose you can call the sort of music I write 'good-time' folk. I have hardly ever written a sad song. I write songs so that people can sing them. They have got to be simple for me to sing them.\" \n\nSadly, on 5th May 1974, tragedy struck when Adge was killed in a car accident at Newbridge roundabout near Chepstow. It was devastating for the band and they had to make a decision on their future. Tommy Banner, Tony Baylis and Pete Budd decided they would continue as a trio under the name of The Wurzels. To them, Adge Cutler was irreplaceable and today Pete and Tommy still speak of him with fondness and consider him to have been a great friend. (There have been calls for Bristol International Airport to be renamed in honour of Adge Cutler). There have been a number of line-up changes over the years, but Pete Budd and Tommy Banner remain familiar faces singing both old and new songs and still enjoying what they do. The current line up includes Tommy Banner who joined the band in November 1967, Pete Budd who originally joined the Wurzels as a banjo player in 1972, John Morgan from the Forest of Dean and Sedge Moore.\n\n\"I think it's because we enjoy what we do, irrespective of what other musicians think... A lot of the songs are very true. A lot of the songs are still Adge's and Adge used to write songs about people and what he saw in a pub. He would jot little things down and that would end up coming out as a song you know about the local fibber called Hark At 'Ee Jacko. That was about the compulsive liar, don't tell real lies just little white ones and it was all based on that.\" Pete Budd\n\nTwo years later, The Wurzels hit the big time with Combine Harvester becoming their first major hit followed by such classics as I Am A Cider Drinker, Morning Glory, Don't Look Back In Anger and Farmer Bill's Cowman. In 2007, The Wurzels released their Greatest Hits on CD and from that released a new version of I Am A Cider Drinker recorded with Tony Blackburn. \n\nThe Wurzels' decades-long association with cider has led to them being known as a 'Scrumpy and Western' band. Such is their standing within the cider-drinking community, they even have a cider named after them, called Wurzel Me cider, produced by North Somerset cider company Thatchers. \n\nTommy Banner recalls an early association with the apple-based beverage: \n\n\"My very first night, very first gig in fact was the World Cider Drinker Championships and we were the support to Acker Bilk and the Paramount Jazz Band. The compere for the evening was a young Bristolian called Fred Wedlock and we've worked with a heck of a lot of artists since then.\" \n\nThe Wurzels' passion for cider is equalled by their passion for football, having been fans of Bristol City FC since the days of Adge Cutler. In 1977, their homage to the club, One For The Bristol City, became City's official anthem. Drink Up Thy Zider still resounds around the terraces of Ashton Gate stadium to this day.\n\nThanks, in part, to appearances at Glastonbury Festival in 2000 and 2008, The Wurzels have established a huge fan base, including a growing network of students. They continue to play a select number of festivals, clubs and pubs across the country.","summary":"Pictured here is the front cover of The Wurzels' Carry On Cutler! album. Press the play button (bottom right) to see them performing their song Drink Up Thy Zider at Coates cider factory in Nailsea, Somerset, in 1967.","source":null,"keywords":["PPL-CR-ICT05"],"type":["Story"],"location":"Bristol People","objects":[{"image":48777,"copyright":"© Bristol Museums, Galleries and Archives","description":"Pink 'Technics' quarter deck and turntable, with black slip mat.","credit_line":null,"id":160584,"name":"record player"}],"child":[{"image":94791,"name":"The Wurzels and Radio Lollipop","link":"the-wurzels-and-radio-lollipop","id":8211}],"parent":[{"image":48777,"name":"Bristol's music scene","link":"bristol-s-music-scene","id":3641}]}