{"images":[{"image":94785,"name":"BCRL, M Shed ICT image, People, record sleeve, Fred Wedlock - Follicks","description":"Record sleeve: Fred Wedlock - The Oldest Swinger in Town, 1981.","copyright":"© Bristol Central Reference Library"}],"name":"Fred Wedlock - 'The Oldest Swinger In Town'","id":7766,"description":"Born in Bristol in 1942, Fred Wedlock was often described as the West Country's Billy Connolly. He started his career as a teacher before turning his hand to performing in folk clubs and concert halls during the late 1960s. His first EP Silbury Hill was released through the Saydisc label in 1965. A talented musician\/singer, storyteller, comedian, TV presenter and great all-rounder, Fred achieved cult status. His list of accomplishments included presenting radio and TV shows and performing in plays, sketches and variety. Locally, this included Up The Feeder, Down The Mouth, a Bristol Old Vic production, which was perfomed open-air on the harbourside in 2001, and Mrs Gerrish's Guesthouse with the Ministry of Entertainment at the Tobacco Factory. \n\nFred also appeared on Top Of The Pops, singing his hit single The Oldest Swinger In Town. Fred recorded the song in 1979 and by 1981 it had reached number six in the singles chart.\n\nSadly, Fred died in 2010. While he never got to see this display that celebrates his contribution to Bristol, he was approached about the possibility of his inclusion in the People gallery at M Shed - a notion that he found wryly amusing.","summary":"In the Bristol folk scene we just didn't realise what a good thing we had. We were at the cutting edge of folk music. Everyone wanted to play here...","source":"Fred Wedlock, quoted in Bristol Folk (2009) by Mark Jones","keywords":["PPL-CR-ICT05"],"type":["Story"],"location":"Bristol People","objects":[{"image":48777,"copyright":"© Bristol Museums, Galleries and Archives","description":"Pink 'Technics' quarter deck and turntable, with black slip mat.","credit_line":null,"id":160584,"name":"record player"}],"child":[{"image":94793,"name":"Portrait of Fred","link":"portrait-of-fred","id":8209},{"image":178302,"name":"OH5 Interview with Fred Wedlock (entertainer)","link":"oh5-interview-with-fred-wedlock--28entertainer-29","id":13353},{"image":97203,"name":"Fred with his \"yard of German plywood\"","link":"fred-with-his--yard-of-german-plywood-","id":8210},{"image":94794,"name":"The Oldest Swinger In Town","link":"the-oldest-swinger-in-town","id":8087},{"image":94891,"name":"Fred Wedlock - 'the disco king meets Yogi Bear'","link":"fred-wedlock----the-disco-king-meets-yogi-bear-","id":8086},{"image":94938,"name":"Fred and Ack","link":"fred-and-ack","id":8212}],"parent":[{"image":48777,"name":"Bristol's music scene","link":"bristol-s-music-scene","id":3641}]}