{"images":[{"image":95114,"name":"M Shed ICT, People, digital image, poster (detail), Bristol Reggae Explosion Live, music event","description":"Detail from a poster image for The Bristol Reggae Explosion Live event, 2012. The event took place from 8pm on Sunday 26th August 2012 at the Big Top, Creative Common,Temple Quay, Bristol. Bands that performed included Talisman, Joshua Moses, The General (Restriction), Bunny Marrett, Dennis McCalla aka Dallas, Winston Minnott (Cool Runnings), Dan Ratchet, Sharon Benjamin, Popsy Curious, Glen Crooks, Buggs Durrant, Lord John Hutchinson, Veereal (Vibes) and Mizizi, featuring Alfred McIntosh.","copyright":null}],"video":[{"image":95114,"name":"M Shed, ICT, Video, Talisman performing Dole Age, Bristol reggae","description":"Talisman reggae band, performing Dole Age at The Bristol Reggae Explosion Live event, at the Big Top, Creative Common, Temple Quay, Bristol, on Sunday 26 August 2012. \n\nDole Age written by Joseph\/Talisman.\nOriginally released in 1980 on Recreational Records.\nAvailable on The Bristol Reggae Explosion Live CD\/DVD (2012). Bristol Archive Records label. www.bristolarchiverecords.com","copyright":null,"video":95106}],"name":"The Bristol Reggae Explosion by Martin Langford (aka Dubmart)","id":7986,"description":"During the winter of 1984\/5, the BBC screened a new sitcom called \u0091The Frontline', and, for six weeks, the sounds and images of Bristol\u0092s own Black Roots were broadcast into the nation\u0092s living rooms along with exterior shots of St. Paul\u0092s and Easton - something all too rare even today in a city now awash with production companies and shoots that all too often head for the uptown comfort of Clifton.\n\nThe premise for \u0091The Frontline\u0092, two brothers, one a policeman and one a dread, trying to live together, may have been rather contrived and the lead characters little more than stereotypes, but it was set in Bristol and showcased the city\u0092s finest purveyors of roots reggae, Black Roots\u0085\n\nBlack Root\u0092s close rivals, Talisman weren\u0092t to be outdone and also enjoyed some primetime national television exposure when they appeared on Harry Secombe\u0092s TV show \u0091Highway\u0092. The Sunday tea-time religious slot was a surprising place to find a roots band and was made all the more incongruous by the performance being filmed in the doorway of a pub in King Street.\n\nBoth bands had built their reputations on the local and national live scene, along with radio sessions for the BBC, and for me those local gigs that coincided with my youth seemed like weekly though in reality far less frequent gigs from the cream of Jamaican and British reggae acts, interspersed with local bands, Joshua Moses, Black Roots, Talisman and Restriction. \n\nAs a kid, my love of reggae found me somewhat culturally isolated. My black classmates were from West African backgrounds and US boogie was more their taste than reggae, while the average white kid knew little beyond Bob Marley. St Paul\u0092s may have been literally five minutes\u0092 walk down my road, but, without someone to guide me, the musical promise it held was a world away, the only exception being Carnival Day. Fortunately, with the exception of The Docklands Settlement, most of the local venues for reggae were more my side of town and so The Studio, Bristol Polytechnic\u0092s Redland campus and Trinity allowed me to get beyond the limitations of a recording and hear so many great live performances.\n\nAlthough Joshua Moses continued to perform at St Paul\u0092s Carnival and as a support act on several reggae bills into the late eighties or early nineties, I wasn\u0092t quite old enough to have caught those classic and pioneering late seventies gigs. Fortunately, there is a legacy of two twelve-inch singles released in the seventies, both of which feature on \u0091Pretty Girl\u0092.\n\nThe second Joshua Moses single, \u0091Africa Is Our Land\u0092, is an entirely different matter. If you had been bothered to trawl through Bristol\u0092s record shops in the late eighties - Tony\u0092s, Revolver, Plastic Wax, Replay, etcetera - you would probably have found one or both of the Talisman singles, an assortment of records from the prolific Black Roots, a copy of \u0091Pretty Girl\u0092, and, if you were lucky, a copy of the Restriction record. What you certainly would not have found was a copy of \u0091Africa Is Our Land\u0092. Pressed in tiny quantities this gem of a UK Roots tune has never been common and has been highly sought after by both collectors and DJs for more than twenty years\u0085\n\nBlack Roots also started in the late seventies and\u0085 are by far the most prolific recording artists amongst any Bristol band. Black Roots were the archetypal British reggae band, trodding the same path as Aswad, Steel Pulse, Misty In Roots and the numerous reggae bands found in every large West Indian population centre in the country\u0085\n\nThis was a band that had the same line-up from 1979 until 1990 and their music and shows were equally consistent.  I never saw them put on a bad show. They would lock into that heavy roots groove and take the audience along with them.\n\nBlack Roots had competition for the title of leading local reggae band and it came from Talisman. Unlike Black Roots, whose line-up was constant for more than a decade, Talisman had a much more volatile membership. The band that released the first two singles\u0085was very different from the band that released the \u0091Takin\u0092 The Strain\u0092 album, the three-piece band they were when I last saw them live in 1986, or the duo which recorded their second and final LP, \u0091Jam Rock\u0092, in 1990. If a Black Roots gig was always consistent, Talisman\u0092s varied line-ups could throw up some surprises and a greater variety of material, but they were consistently highly entertaining.\n\nRestriction are perhaps the forgotten band in this story. They released just one four-track twelve-inch\u0085 and a very scarce cassette, \u0091Pattern Is Changing\u0092. They didn\u0092t get the TV appearances or the attention from the music press that Black Roots and Talisman received and their career was shorter. Restriction often shared the same bill as Black Roots, but in many ways they were travelling a completely different musical path. Like the early line-ups of Talisman, they had both black and white musicians, but, much more significantly, they had a female vocalist, Jenny Allison, who also provided backing vocals on Talisman\u0092s \u0091Takin\u0092 The Strain\u0092.\n\nBlack Roots may have been the picture of an authentic roots band, but Restriction brought a freedom to the genre\u0085.I found them the most entertaining of the trio, not the best, but the most fun.\n\nBy 1986, the whole scene seemed to just evaporate.  I\u0092m not sure of the exact causes, but an interview with Restriction\u0092s John Hollis in a January 1986 edition of the Bristol Evening Post bemoans the lack of local gigs and suggests that Restriction were planning to head for abroad in search of shows. The continent certainly welcomed Black Roots, and, as for Talisman, well they had just about ceased to exist as a live band. Only Black Roots with their regular appearances at St. Paul\u0092s Carnival continued as a live act into the following decade. \n\nWhat I do know is that by 1986 reggae itself had changed. \u0091Sleng Teng\u0092 and the era of digital dancehall made big roots bands seem like dinosaurs. The next generation of black kids who would have replenished reggae sound systems and bands alike were turning to hip hop and would soon be embracing house, rave and the truly British bastard-child of reggae - jungle. The Jamaican bands that had once played at The Studio were now more likely to be sound systems\u0085 the venues themselves were also living on borrowed time. Both the Redland Poly site and The Studio would be pulled down to make way for flats. The Docklands ceased to be a venue and only Trinity survived through various managements and refits to continue as a live venue.\n\nLive reggae never went away. Singers like Dennis McCalla, Dan Ratchet and former Black Roots vocalist Delroy Ogilvie carried on. We briefly had Vin Gordon and the Authentics playing an earlier style of reggae and Bath\u0092s Rhythm-Ites played their part. The Malcolm X Centre, Black Swan and other venues would spring up, but, by the 1990s, the local reggae scene was to be much more rooted in the studio, with Henry and Louis and Armagideon providing a constant stream of releases. While numerous others toiled away for their own pleasure or dub plate specials, many of these unsung local productions can be found on the three volumes of \u0091Dub Out West\u0092.\n\nThere is a more tangible legacy. In the 1990s, The \u0093Bristol Sound\u0094 achieved a sort of world domination. No selection of the decade\u0092s best releases was complete without a Bristolian contribution - Massive Attack, Portishead, Tricky and Reprazent - they all had their reggae links and one man in particular played a key role in both the roots scene and the Bristol Sound. Rob Smith was a guitarist in Restriction, but, within three years of that band\u0092s demise, he had collaborated on the first release to be credited to Massive Attack,  Any Love, had produced a top-ten single in Fresh Four\u0092s \u0091Wishing On A Star\u0092 and with Ray Mighty had started the pioneering  3 Stripe label, home to some great releases.\n \nRob would go on to pioneer jungle and be a pivotal figure in the Bristol dubstep scene, but still produces reggae using the Blue And Red moniker. It was Rob Smith who invited a young Dave McDonald to embark on a career as a sound engineer. This is the same Dave McDonald whose image graces the cover of Restriction\u0092s sole record and who would go on to be the engineer for the first two Portishead albums and the effective fourth member of that band. That very same record that featured Dave McDonald\u0092s face was produced at Ariwa Studios by Neil Fraser (The Mad Professor). As well as being the UK\u0092s leading reggae producer of the past thirty years, he would gain his widest exposure when he remixed Massive Attack\u0092s second album into its dub counterpart \u0091No Protection\u0092. Reggae fitted the Bristol psyche like a glove and it\u0092s a reggae bass line that underpins so much of Bristol\u0092s music, regardless of genre.\n\nSource: www.bristolarchiverecords.com","summary":"Click the play button (bottom right) to hear Talisman performing 'Dole Age' at The Bristol Reggae Explosion Live event, 2012. This can be heard on The Bristol Reggae Explosion Live CD\/DVD - available to buy in the museum shop!","source":null,"keywords":["PPL-CR-ICT05"],"type":["Story"],"location":"Bristol People","objects":[{"image":48777,"copyright":"© Bristol Museums, Galleries and Archives","description":"Pink 'Technics' quarter deck and turntable, with black slip mat.","credit_line":null,"id":160584,"name":"record player"}],"child":[{"image":95093,"name":"Talisman","link":"talisman","id":7989},{"image":95090,"name":"Black Roots","link":"black-roots","id":7993},{"image":95091,"name":"Black Roots","link":"black-roots","id":7994},{"image":95094,"name":"Restriction","link":"restriction","id":7995}],"parent":[{"image":48777,"name":"Bristol's music scene","link":"bristol-s-music-scene","id":3641}]}